app/controllers/cancions_controller.rb

SELECT  "cancions".* FROM "cancions"  WHERE (upper(cancion) like '%CANCIOIN%')  ORDER BY cancion LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "cancions"  WHERE (upper(cancion) like '%CANCIOIN%')
---
  def index
    @cancions = Cancion.search(params[:search], params[:page])

INSERT INTO "cancions" ("artista", "cancion", "created_at", "genero", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artista", "jesus romero"], ["cancion", "te amo"], ["created_at", "2014-06-16 19:51:14.214083"], ["genero", "cristiana"], ["updated_at", "2014-06-16 19:51:14.214083"]]
---
  def create
    @cancion = Cancion.new(cancion_params)

    respond_to do |format|
      if @cancion.save

UPDATE "cancions" SET "artista" = ?, "cancion" = ?, "genero" = ?, "updated_at" = ? WHERE "cancions"."id" = 1  [["artista", "Jesus Adrian romero"], ["cancion", "Mi universo"], ["genero", "Adoracion"], ["updated_at", "2014-06-17 19:41:56.589342"]]
---
  def update
    respond_to do |format|
      if @cancion.update(cancion_params)

SELECT  "cancions".* FROM "cancions"  WHERE "cancions"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_cancion
      @cancion = Cancion.find(params[:id])