app/controllers/directivas_controller.rb

SELECT "directivas".* FROM "directivas"
---
  def index
    @directivas = Directiva.all

SELECT  "directivas".* FROM "directivas"  WHERE "directivas"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @directiva = Directiva.find(params[:id])

INSERT INTO "directivas" ("apellido", "cargo", "created_at", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?)  [["apellido", "Montero"], ["cargo", "Pastor"], ["created_at", "2014-06-13 20:50:01.069105"], ["nombre", "Juan pablo"], ["updated_at", "2014-06-13 20:50:01.069105"]]
---
  def create
    @directiva = Directiva.new(directiva_params)

    respond_to do |format|
      if @directiva.save

SELECT  "directivas".* FROM "directivas"  WHERE "directivas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_directiva
      @directiva = Directiva.find(params[:id])