app/controllers/eventos_controller.rb

SELECT  "eventos".* FROM "eventos"  WHERE (upper(nombre) like '%GFHJ%')  ORDER BY nombre LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "eventos"  WHERE (upper(evento) like '%GFHJ%')
---
  def index
    @eventos = Evento.search(params[:search], params[:page])

INSERT INTO "eventos" ("created_at", "descripcion", "evento", "fecha", "hora_final", "hora_inicio", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

SELECT  "eventos".* FROM "eventos"  WHERE "eventos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_evento
      @evento = Evento.find(params[:id])